{
    "title": "Senior Frontend Engineer",
    "company": "Meta",
    "summary": "Meta is seeking a Senior Frontend Engineer to develop and maintain secure, scalable third-party integrations. You will leverage modern React.js techniques and cross-context communication strategies to build high-performance, reliable user interfaces. This role requires close collaboration with engineers and product stakeholders to deliver solutions that enhance integration experiences.",
    "employment": {
        "type": "Contract",
        "durationMonths": 5,
        "classification": ["T4", "IC"],
        "potentialToConvert": true,
        "location": "Toronto (hybrid)",
        "benefits": ["Paid holidays"]
    },
    "responsibilities": [
        "Build and maintain frontend components to enable secure and scalable third-party integrations.",
        "Implement cross-context communication strategies (iframes, postMessage API, Web Workers, Electron).",
        "Utilize advanced React.js features (hooks, Context API, Redux/Zustand) for performant and maintainable UI.",
        "Identify and resolve performance bottlenecks using profiling tools, Lighthouse, and Web Vitals.",
        "Debug and troubleshoot complex client-side issues across multiple browsers using developer tools and source maps.",
        "Collaborate with cross-functional teams to deliver high-quality integration solutions."
    ],
    "requiredSkillsAndExperience": [
        "5+ years of professional frontend development experience, with 3+ years using React.js.",
        "Advanced proficiency in JavaScript (ES6+) and TypeScript.",
        "Strong expertise in React.js ecosystem tooling, including hooks, Context API, Redux/Zustand, and performance optimization.",
        "Experience designing cross-context communication patterns (iframes, postMessage API, Web Workers).",
        "Hands-on experience with Webpack and Rollup, including micro-frontend techniques such as module federation.",
        "Proven ability to diagnose and fix web performance issues using profiling and auditing tools.",
        "Strong debugging and troubleshooting skills across major browsers."
    ],
    "education": "Bachelor’s degree in Computer Science, Software Engineering, or related field, or equivalent practical experience."
}
